{"pageContext":{"isCreatedByStatefulCreatePages":false,"wordpress_id":26,"title":"Man City relax add-on demands to seal Raheem Sterling deal &#8211; sources","slug":"man-city-relax-add-on-demands-to-seal-raheem-sterling-deal-sources","excerpt":"","content":"<p>\t\t\t\t<img class=\"alignnone wp-image-28 size-full\" src=\"http://localhost/gatsbySite_wp/wp-content/uploads/2017/12/pic.jpg\" alt=\"\" /></p>\n<p>Manchester City finally made the breakthrough in their pursuit of Liverpool&#8217;s Raheem Sterling after relaxing their stipulations over add-ons in the most expensive deal ever for an English player, sources have told ESPN FC. City agreed a fee of £44 million up front and a further £5m payable in add-ons on Sunday in what has been the most protracted transfer of this summer&#8217;s transfer window. But, with the two clubs wrangling over how the fee would be paid, sources have told ESPN FC that City relaxed their initial proposal for the add-ons to make it easier for Sterling to meet and ensure Liverpool receive the £49m sum quicker. The initial add-ons were dependent on City being successful in the Premier League and Champions League, but now City have agreed to pay the additional money when Sterling meets a set number of appearances instead. As revealed by ESPN FC last month, City&#8217;s hierarchy had given the green light for the club to meet Liverpool&#8217;s £50m valuation for Sterling as they had made him one of their top targets this summer. The Etihad club saw their first two bids of £30m and £40m plus add-ons for Sterling rejected by Liverpool as the Merseysiders held out for a fee closer to their valuation. Part of the reason that Liverpool wanted more money up front was the fact that Queens Park Rangers are entitled to a 20 percent sell-on fee from the player&#8217;s time at Loftus Road. Sterling joined Liverpool from QPR&#8217;s academy in 2010 and although he never played a game for the club they inserted the sell-on fee as part of the deal that took him to Liverpool. It means the Championship club are set for a windfall of £9.8m from the sale of Sterling to City.\t\t</p>\n"}}